# 初期設定群

In [5]:
import pandas as pd
import pandas_gbq as bq

In [6]:
"Hello World"

'Hello World'

In [7]:
q = """
SELECT
FORMAT('%04d/%02d', EXTRACT(year FROM date),EXTRACT(month FROM date)) as month,
COUNT(unique_key) AS count
FROM `bigquery-public-data.chicago_crime.crime`
GROUP BY month
ORDER BY month ASC
"""

In [8]:
df = bq.read_gbq(q, project_id="tfandkusu")
df

Downloading: 100%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████|

       month  count
0    2001/01  38121
1    2001/02  33789
2    2001/03  40570
3    2001/04  40091
4    2001/05  41839
..       ...    ...
274  2023/11  21202
275  2023/12  21067
276  2024/01  19142
277  2024/02  19262
278  2024/03   4520

[279 rows x 2 columns]